ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_memss_l_config_regs.xml
<module id="MEMSS_L_CONFIG_REGS" HW_revision="" description="MEMSS L CONFIG Registers">
	<register id="LPA0_MEM_CONFIG" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="LPA0 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LPA0 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LPA0 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LPA0_MEM_CONFIG_LOCK" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Temporary Lock for LPA0 Memory Configuration Register ">
		<bitfield id="LPA0_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LPA0_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Permament Lock for LPA0 Memory Configuration Register ">
		<bitfield id="LPA0_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LPA1_MEM_CONFIG" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="LPA1 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LPA1 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LPA1 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LPA1_MEM_CONFIG_LOCK" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Temporary Lock for LPA1 Memory Configuration Register ">
		<bitfield id="LPA1_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LPA1_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="Permament Lock for LPA1 Memory Configuration Register ">
		<bitfield id="LPA1_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA0_MEM_CONFIG" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="LDA0 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA0 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LDA0 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LDA0_MEM_CONFIG_LOCK" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="Temporary Lock for LDA0 Memory Configuration Register ">
		<bitfield id="LDA0_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA0_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="Permament Lock for LDA0 Memory Configuration Register ">
		<bitfield id="LDA0_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA1_MEM_CONFIG" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="LDA1 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA1 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LDA1 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LDA1_MEM_CONFIG_LOCK" width="32" page="0" offset="0x34" instances="1" instaddr="4" internal="0" description="Temporary Lock for LDA1 Memory Configuration Register ">
		<bitfield id="LDA1_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA1_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x38" instances="1" instaddr="4" internal="0" description="Permament Lock for LDA1 Memory Configuration Register ">
		<bitfield id="LDA1_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA2_MEM_CONFIG" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="LDA2 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA2 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LDA2 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LDA2_MEM_CONFIG_LOCK" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="Temporary Lock for LDA2 Memory Configuration Register ">
		<bitfield id="LDA2_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA2_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="Permament Lock for LDA2 Memory Configuration Register ">
		<bitfield id="LDA2_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA3_MEM_CONFIG" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="LDA3 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA3 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LDA3 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LDA3_MEM_CONFIG_LOCK" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="Temporary Lock for LDA3 Memory Configuration Register ">
		<bitfield id="LDA3_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA3_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="Permament Lock for LDA3 Memory Configuration Register ">
		<bitfield id="LDA3_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA4_MEM_CONFIG" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="LDA4 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA4 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LDA4 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LDA4_MEM_CONFIG_LOCK" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="Temporary Lock for LDA4 Memory Configuration Register ">
		<bitfield id="LDA4_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA4_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x68" instances="1" instaddr="4" internal="0" description="Permament Lock for LDA4 Memory Configuration Register ">
		<bitfield id="LDA4_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA5_MEM_CONFIG" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="LDA5 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA5 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LDA5 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LDA5_MEM_CONFIG_LOCK" width="32" page="0" offset="0x74" instances="1" instaddr="4" internal="0" description="Temporary Lock for LDA5 Memory Configuration Register ">
		<bitfield id="LDA5_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA5_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="Permament Lock for LDA5 Memory Configuration Register ">
		<bitfield id="LDA5_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA6_MEM_CONFIG" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="LDA6 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA6 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LDA6 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LDA6_MEM_CONFIG_LOCK" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="Temporary Lock for LDA6 Memory Configuration Register ">
		<bitfield id="LDA6_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA6_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="Permament Lock for LDA6 Memory Configuration Register ">
		<bitfield id="LDA6_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA7_MEM_CONFIG" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="LDA7 Memory Configuration Register">
		<bitfield id="TESTMODE" description="LDA7 Test Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INIT" description="Triggers memory Initilization " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INIT_STS" description="LDA7 INIT status" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="LDA7_MEM_CONFIG_LOCK" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="Temporary Lock for LDA7 Memory Configuration Register ">
		<bitfield id="LDA7_MEM_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LDA7_MEM_CONFIG_COMMIT" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="Permament Lock for LDA7 Memory Configuration Register ">
		<bitfield id="LDA7_MEM_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
